[
    {
        "Title": "Kinoo",
        "Body": "As a Senior Gameplay Engineer at Kinoo, I played a key role in developing a video chatting app that augmented experiences between grandparents and grandchildren. Over the course of two years, I developed seven multiplayer games that facilitated conversation and interest between players. Each game had its own unique design and challenges, such as a Jigsaw puzzle game that would play a video when the puzzle was completed, this project required I create whole new asset data management system that could handle art for hundreds of different puzzles,  and a baking story telling game the incorporated Kinoo's Magic wand controller where I used an array of sensors to read gestures such as stirring, or chopping.\n<br><br>\nTo support our game development, I worked closely with the art team to create art pipelines to streamline asset development, and workflows for developing games with reusable components, which increased production efficiency by 3x and reduced asset development time by 50%. In my time there I mastered many skills including, object-oriented design principles, which I used to create reusable components and improve code maintaibility and scalability, asynchrounous code logic and multiplayer logic which was used to ensure that both players experiences the expected behavior even on the slowest network connection, 3D math to properly calculate the gesture input for the Kinoo Magic wand, and much more.",
        "Images": [
            "https://media2.giphy.com/media/v1.Y2lkPTc5MGI3NjExMzRjYTRlZDU1OGFlMTk4ZWYxMDc0YzkyNzgxOTFhNjE2ZTA0YTAyZiZjdD1n/tyULTDf4Fnd9OwJct1/giphy.gif",
            "https://i.imgur.com/n5i4e0V.png?1",
            "https://media4.giphy.com/media/e25aTHGWwesy2T4ad7/giphy.gif",
            "https://i.imgur.com/qlrax6u.png?1",
            "https://i.imgur.com/2zgr95P.png",
            "https://i.imgur.com/HCn9uPE.png?1"
        ],
        "IText": [
            "In this game the player uses the Kinoo Magic Wand<br>       to control the spoon stirring the cookie batter<br>",
            "In Dot to Dot players walk to a story and<br>       play a connect the dot puzzle at certain points<br>",
            "Players would shake the Magic Wand to sculpt creatures<br>       that come to live<br>",
            "We would place the video feed into space suits<br>       to create a Mad-lib style story game<br>",
            "With one other developer we created an app for both<br>       Android and iOS so that kids could play single player<br>       games with the Magic Wand<br>",
            "A memory game where players would work together to match cards together<br>"
        ]
    },
    {
        "Title": "Bully!",
        "Body": "For Bully! I was contracted to develop the gesture mechanic of a 3D golf game. In the 2 month contract I developed an android app that hosted a websocket server, and a Unity game that would connect to that server and listen for sensor data. This approach allowed for a quick and seamless user onboarding process. Once connected the phone acted as a controller letting the player click buttons to rotate left/right and move the phone to swing the golf club back and forth. ",
        "Images": [
            "https://media2.giphy.com/media/BraoIcTZPRvZgzTr9O/giphy.gif",
            "https://media3.giphy.com/media/XnzIpLE85DvYg3Bhsc/giphy.gifm",
            "https://media1.giphy.com/media/Pddzco7pnNM8EjK0VD/giphy.gif",
            "https://i.imgur.com/V9QBsGw.png",
            "https://i.imgur.com/ugwrm8m.png"
        ],
        "IText": [
            "The gesture mechanic in action<br>",
            "An early prototype of the phone controlling the Animator<br>",
            "I helped to improve physics mechanics of the golf ball<br>",
            "I developed the Android app ui to be intuitive and simple to use<br>",
            "Once a device is connected the app would automatically<br>       show the controller UI<br>"
        ]
    },
    {
        "Title": "Run Boggo, Run!",
        "Body": "Buzzfeeds first game, Run Boggo Run is an endless runner-style mobile-game. It is up to you to help Boggo escape from the giant Stress Monster and unlock her Chakras!<br><br> I worked with a team of designers, artists, and animators as the sole developer to create this game. Over 10 weeks we worked to release an early access build. In that time I setup version control/review workflows and tools to allow for other teammates to incorporate their work. I also rapidly prototyped and iterated upon in-game mechanics, and features, created custom physics and character controllers, and developed all necessary systems and more. <br><br>After the initial release we rebalanced the game, created more content, created a free version with ads, and optimized the game based on the feedback we received by our players.<br><br><a href = \"https://apps.apple.com/us/app/run-boggo-run-to-nirvana/id1554388600\"target = \"_blank\"><u>iOS Download</u></a> <br><br><a href = \"https://play.google.com/store/apps/details?id=com.BuzzFeed.RunBoggoRunFree&hl=en_US&gl=US\"target = \"_blank\"><u>Android Download</u></a>",
        "Images": [
            "https://i.imgur.com/4eIHpuR.png",
            "https://i.imgur.com/OKLRZbm.png",
            "https://i.imgur.com/1p7FkKF.png",
            "https://i.imgur.com/FBdLy8S.png",
            "https://i.imgur.com/gJgnxy7.png",
            "https://i.imgur.com/Y6ZHFy4.png"
        ],
        "IText": [
            "",
            "The 'Stress Monster' got closer to Boggo every<br>       time he would run into an obstacle<br>",
            "By swiping on the screen the player could toss a<br>       bath bomb to knock the stress monster back.<br>",
            "I developed a data driven leveling system<br>",
            "I used an MVC design pattern to create the UI<br>       and an object pooling system to improve efficiency.<br>",
            ""
        ]
    },
    {
        "Title": "[ERR]rational",
        "Body": "[ERR]rational is an audio-visual artwork that is completely generated through mathematics.<br><br> The term math tends to trigger negative memories for most, and that is due to how we are exposed to it.  It is presented to us as a convoluted set of rules that we must follow to achieve an arbitrary answer, but  in reality math is a rich and complex language. It is a way to explain the relationships that surround, and impact our lives.<br><br>In this piece, I use the principles of signal processing to create 3D objects and tonal patterns. By using mathematics as an artistic medium it becomes clear that we do not need to separate the arts and sciences as we do, and should instead embrace the rich creative complexities of the field.<br><br><a href =\"https://mc-gamedeveloper.github.io/portfolio/Thesis/index.html\" target = \"_blank\"><u>Click Here</u></a> to see the full project",
        "Images": [
            "https://i.imgur.com/maV2QIE.gif",
            "https://i.imgur.com/78YKZSA.gif",
            "https://i.imgur.com/t2E5sx9.gif"
        ],
        "IText": [
            "",
            "",
            ""
        ]
    },
    {
        "Title": "Alphabets Got Talent",
        "Body": "Alphabets Got Talent is the product of a 48 hour Morse Code Game Jam by a team of two Parsons and two New York University students in partnership with The Adaptive Design Association and Google.<br><br>The goal of the project was to teach our client Morse code in a fun, interactive way using topics they were interested in. Our team was paired with an Adaptive Design client who had limited motor functions, so we used two simple switches, to represent the dot and dash of Morse code. These switches then utilized the Google Gboard Morse keyboard to control the output of letters. In the game, the user uses the switches to type a letter in Morse Code and an animal with the corresponding name would appear “dancing” and making animal noises. For example an elephant appearing when the user enters a dit (dot), the Morse code for “e.”<br><br>This project was featured on the <a href = \"https://experiments.withgoogle.com/alphabets-got-talent\"target = \"_blank\"><u>Google Experiments</u></a> page",
        "Images": [
            "https://i.imgur.com/qgUoh6r.png",
            "https://i.imgur.com/13fGFBA.png",
            "https://i.imgur.com/f8oLcQO.png",
            "https://i.imgur.com/6fghUD0.png"
        ],
        "IText": [
            "",
            "The Yellow dash types a T<br>       and a Tiger dances across the screen<br>",
            "The Red dot types an E<br>       and an Elephant dances across the screen<br>",
            "We ran user testing to ensure an intuitive and<br>       comfortable experience<br>"
        ]
    },
    {
        "Title": "Creative Mathematics",
        "Body": "As a study into both Unity and Mathematics, I developed a series of sketches to explore different perspectives of these topics. These sketches delve into varied aspects of both Unity and math. I cover mathematical topics ranging from trigonometry, fractals, and boid logic. For Unity I explore the line renderer, trail renderer, lighting, and shaders.",
        "Images": [
            "https://media2.giphy.com/media/UrVBjoqpqFQTB4tHlv/giphy.gif",
            "https://media0.giphy.com/media/VJxWtkyq5qAvgX617N/giphy.gif",
            "https://media.giphy.com/media/m9p9CUiHlsvEv3Z3qR/giphy.gif",
            "https://media.giphy.com/media/YQ5hhyI5RgAvxNgID4/giphy.gif",
            "https://media.giphy.com/media/f9Z0Kx7pHo39CpD7G9/giphy.gif",
            "https://media2.giphy.com/media/dZFVIb5zmBte0MRWQ3/giphy.gif"
        ],
        "IText": [
            "Exploring Trigonometric movement in multiple dimensions<br>",
            "Extending the Trigonometric experiment to harmonic functions<br>",
            "Exploring Tesselation and noise<br>",
            "Continuing to look at noise in context of stylized water<br>",
            "Experimenting with Boid logic<br>",
            "Combining all experiments into an ultimate structure<br>"
        ]
    },
    {
        "Title": "Smart Glitchy Kitchen",
        "Body": "In this project I was responsible for developing the user experience by using both Unity and Arduino to communicate with one another.<br><br>Smart Glitchy Kitchen is a physical game with a large scale controller where a rookie chef needs to prepare an apple pie by carefully following the instructions. What our beloved chef doesn’t know is that this new tech kitchen has lots of flaws and glitches. It seems easier than it is. <br><br>In the end, Smart Glitchy Kitchen was exhibited in the independent game gallery called \"Baby Castles\". The game was too difficult for any one person, but it was great to see teams of people struggle to cook their pie in the alloted time.",
        "Images": [
            "https://i.imgur.com/Nq1qr64.png",
            "https://i.imgur.com/73XFv06.jpg",
            "https://i.imgur.com/E5TLoys.png",
            "https://i.imgur.com/8QNzw75.png",
            "https://i.imgur.com/H9c9Req.jpg",
            "https://i.imgur.com/HRf7MUE.jpg"
        ],
        "IText": [
            "",
            "The installation of the game<br>",
            "Our ideation process of different mechanics we could implement<br>",
            "Our simple design document showing final fabrication<br>       and user flow<br>",
            "An interactive pie with pressure sensors that needed to be pressed<br>       in a particular way to progress the game<br>",
            "Early implementation of our chopping and stirring interactions<br>"
        ]
    },
    {
        "Title": "Ocean Sim Tool",
        "Body": "This is a project to explore graphics programming, and tool development within Unity. There are currently two parts to this, a day/night cycle that allows you to manipulate the angle of the sun and speed of it's movement. These properties allow a developer to create a more realistic environment and adds realistic lighting for different seasons or latitudes. This is achieved by using trigonometry to properly angle the directional light on a circle opposed to having the sun rise/set on a perfectly vertical path. The other part is a shader that allows the developer the create realistic waves. The Wave shader uses Trochoidal or Gerstner waves to emulate the realism of actual fluid dynamics. Currently in development is a tool for designers to dictate the number of waves, and all other appropriate properties.",
        "Images": [
            "https://media1.giphy.com/media/jokm2VqAgtY14A1aiU/giphy.gif",
            "https://media1.giphy.com/media/ZdOVeHNu8buM2Cpacc/giphy.gif",
            "https://media3.giphy.com/media/l4p7oCSu7VOIWPXQeU/giphy.gif"
        ],
        "IText": [
            "",
            "",
            ""
        ]
    },
    {
        "Title": "Game Design Residency",
        "Body": "During this Game Design Residency with the Staten Museum of Kunst in Copenhage, I collaborated with students from the \"Royal Danish Academy of Fine Arts\" to create this interactive game.<br><br>The goal of this residency was to increase audience engagement. The museum saw that people, on average, would visit less than 2 of their exhibits. So, we created a game that would encourage exploration through the space<br><br>Users would wear these masks, which would have prompts on them to explore the museum from a new perspective. Through testing we found that there was a significant increase in how far museum goers would explore along with them enjoying the experience of being part of the performance.",
        "Images": [
            "https://i.imgur.com/lkOeAI6.jpg",
            "https://i.imgur.com/wNNfxt3.jpg",
            "https://i.imgur.com/GFG6hbk.jpg",
            "https://i.imgur.com/xZN26EE.jpg",
            "https://i.imgur.com/SPVaEwr.jpg",
            "https://i.imgur.com/KqjM7CQ.jpg"
        ],
        "IText": [
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    },
    {
        "Title": "Boss Fight",
        "Body": "Boss Fight is inspired by \"The Legend of Zelda: A Link to the Past\". Working with one other developer we created this game within a week. I was responsible for the animations and code development for the Boss and for the player. While my counterpart developed the audio and user interface. This project, while small, explores many aspects of Unity, sprite animation, version control, and gave us a better understanding of game development.<br><br> Boss Fight can be played <a href ='https://mt-cent.itch.io/boss-fight' target = '_blank'><u>here</u></a> <br>Other small games I have made can be played <a href ='https://mt-cent.itch.io/' target = '_blank'><u>here</u></a>",
        "Images": [
            "https://media0.giphy.com/media/WTL764Pam3Holfpi0K/giphy.webp",
            "https://media2.giphy.com/media/Mdiy2b8riPFS7lDZ3z/giphy.webp",
            "https://media1.giphy.com/media/RlZt1NpqgxhkjiTcsU/giphy.webp",
            "https://media0.giphy.com/media/Xy27Wet1a19bQ5lqYW/giphy.gif",
            "https://media2.giphy.com/media/jsNR2hrGiqcvtG6B9W/200w.webp",
            "https://media1.giphy.com/media/igzbVWyw7px95ZRnVh/giphy.webp"
        ],
        "IText": [
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    }
]